/* "Напишете функция, която преброява колко думи има в един стринг, който й се подава като параметър." */
#include <stdio.h>

/* Дефинираме две променливи които са константни. Една за знак и една за буква. */
#define Sign   0
#define Letter 1
/* Създаваме функция която ще използваме ,за да можем да прочетем даден текс въведен от потребителя. */
void getInput(char *str) {
    char c ;
    /* Създаваме цикъл при който докато потребителя въвежда елементи и не натисне нов ред ние броим дължината на стринга */
    while ((c = getchar()) != '\n') {
        *str++ = c;
    }
    *str ='\0';
}
/* Създаваме функцията която ще премине през всички елементи от стринга и ще изброи думите. */
unsigned countTheWords(char *str) {
    int state = Sign;
    unsigned WordCounter = 0;
    /* Обхождаме стринга/ низа*/
    while (*str)
    {     /* Проверяваме дали елемента е знак, разстояние, нов ред или табулация, които не броим */
        if (*str == ' ' || *str == '\n' || *str == '\t' || *str == '.' || *str == '!' || *str == '?' || *str == ',' || *str == ':' || *str == ';' || *str == '@' || *str == '#' || *str == '$' || *str == '%' || *str == '^' || *str == '&' || *str == '*' || *str == '+' || *str == '=' || *str == '"' ) { 
            state = Sign;
        } else if (state == Sign) {
            state = Letter;
            ++WordCounter;/* Брояч на думите. */
        }
        ++str; /* Преминаваме на следващият елемент. */
    }
    return WordCounter; /* Връщаме резултата от броенето на думите */
}
/* Нашата main функция в която искаме от потребителя да въведе своя текст и ние му връщаме броя на думите в него. */
int main(void) {
    char str[256];

    printf("Enter your text here:"); 
    getInput(str);
    printf("Numbers of words in \"%s\" : %d", str, countTheWords(str));
    return 0;
}
